enhance docs
